package languages;

import javafx.application.Platform;
import javafx.stage.Stage;

import java.util.ListResourceBundle;

public class LanguageRU extends ListResourceBundle {
    @Override
    public Object[][] getContents ( ) {
        return contents;
    }

    public static String serverIsNotAv = "Сервер недоступен";
    public static String enterRouteTitle = "goEnterRoute";

    private Object[][] contents = {
            {"Badd", "Добавить маршрут"},
            {"Bsum_of_distance", "Cумма расстояний маршрутов"},
            {"Bhistory", "История"},
            {"Binfo", "Информация"},
            {"Bexecute_script", "Выполнить скрипт"},
            {"Bclear", "Очистить коллекцию"},
            {"Bfilter_less_than_distance", "Показать маршруты, расстояние которых меньше"},
            {"Bprint_ascending", "Показать коллекцию в порядке возрастания"},
            {"Bremove_lower", "Удалить маршруты, которые больше заданного"},
            {"Bremove_greater", "Удалить маршруты, которые меньше заданного"},
            {"blup", "Можете пожамкать и снять стресс"},
            {"user", "Пользователь:"},
            {"user1", "Пользователь:"},
            {"language", "Выберите язык"},
            {"language1", "Выберите язык"},
            {"graphics", "Графика"},
            {"collection", "Коллекция"},
            {"owner", "Владелец"},
            {"id", "id"},
            {"name", "Название маршрута"},
            {"coordinateX", "Текущий X"},
            {"coordinateY", "Текущий Y"},
            {"creationDate", "Дата создания"},
            {"fromName", "Название отправления"},
            {"fromX", "Отправление X"},
            {"fromY", "Отправление Y"},
            {"toName", "Название прибытия"},
            {"toX", "Прибытие X"},
            {"toY", "Прибытие Y"},
            {"Ddistance", "Расстояние"},
            {"connect", "Установка соединения..."},
            {"enterAddress", "Введите адрес"},
            {"enterPort", "Введите порт"},
            {"Ууууу, в адресе не должно быть пробелов", "Ууууу, в адресе не должно быть пробелов"},
            {"Порт с пробелами, серьезно? Зачем?", "Порт с пробелами, серьезно? Зачем?"},
            {"Такого адреса, к сожалению, не существует", "Такого адреса, к сожалению, не существует"},
            {"Порт должен быть циферкой", "Порт должен быть циферкой"},
            {serverIsNotAv, "Сервер недоступен"},
            {"Соединение установлено", "Соединение установлено"},
            {"buttonConnect", "Подключиться"},
            {"inLK", "Вход в учетную запись"},
            {"userr", "Логин"},
            {"pass", "Пароль"},
            {"signUp", "Зарегистрироваться"},
            {"signIn", "Войти"},
            {"Пользователь с таким логином уже зарегистрирован. Может, вам стоит авторизоваться?", "Пользователь с таким логином уже зарегистрирован. Может, вам стоит авторизоваться?"},
            {"Вы успешно зарегистрировались", "Вы успешно зарегистрировались"},
            {"Пользователь с таким логином не зарегистрирован", "Пользователь с таким логином не зарегистрирован"},
            {"Вы успешно авторизовались", "Вы успешно авторизовались"},
            {"Вы ввели неправильный пароль", "Вы ввели неправильный пароль"},
            {"Вам следует использовать только латиницу( Вините helios, не меня", "Вам следует использовать только латиницу( Вините helios, не меня"},
            {"resultExecCom", "Результат выполнения команды"},

            {"Объект успешно добавлен в коллекцию!", "Объект успешно добавлен в коллекцию!"},
            {"Объекты, принадлежащие вам, были успешно удалены", "Объекты, принадлежащие вам, были успешно удалены"},
            {"Скрипт выполнен", "Скрипт выполнен"},
            {"ой, а таких элементов-то и нет :(", "ой, а таких элементов-то и нет :("},
            {"Вы еще ничего не вводили", "Вы еще ничего не вводили"},
            {"Время инициализации коллекции: ", "Время инициализации коллекции: "},
            {"Количество элементов в коллекции: ", "Количество элементов в коллекции: "},
            {"Тип коллекции: ", "Тип коллекции: "},
            {"Элемент удален!", "Элемент удален!"},
            {"Элемент не найден и/или вам не принадлежит", "Элемент не найден и/или вам не принадлежит"},
            {"Элементы, большие заданного и принадлежащие вам, успешно удалены", "Элементы, большие заданного и принадлежащие вам, успешно удалены"},
            {"Элементы, меньшие заданного и принадлежащие вам, успешно удалены", "Элементы, меньшие заданного и принадлежащие вам, успешно удалены"},
            {"Элементов в коллекции: ", "Элементов в коллекции: "},
            {"Коллекция пуста", "Коллекция пуста"},
            {"Суммарная длина всех маршрутов : ", "Суммарная длина всех маршрутов : "},
            {"Объект обновлен!", "Объект обновлен!"},
            {"Элемент с введенным id не найден и/или вам не принадлежит", "Элемент с введенным id не найден и/или вам не принадлежит"},

            {enterRouteTitle, "Го заполним поля объекта?"},
            {"nameER", "Название маршрута"},
            {"nowXER", "Текущее местоположение X"},
            {"nowYER", "Текущее местоположение Y"},
            {"fromNameER", "Название места отправления"},
            {"fromXER", "Координата X места отправления"},
            {"fromYER", "Координата Y  места отправления"},
            {"toNameER", "Название места прибытия"},
            {"toXER", "Координата X места прибытия"},
            {"toYER", "Координата Y места прибытия"},
            {"distanceER", "Дальность маршрута"},
            {"doneER", "Выполнить"},
            {"Текущая координата X должна быть целой чиселкой :)", "Текущая координата X должна быть целой чиселкой :)"},
            {"Текущая координата Y должна быть целой чиселкой :)", "Текущая координата Y должна быть целой чиселкой :)"},
            {"Координата X места отправления должна быть целой чиселкой :)", "Координата X места отправления должна быть целой чиселкой :)"},
            {"Координата Y места отправления должна быть целой чиселкой :)", "Координата Y места отправления должна быть целой чиселкой :)"},
            {"Координата X места прибытия должна быть целой чиселкой :)", "Координата X места прибытия должна быть целой чиселкой :)"},
            {"Координата Y места прибытия должна быть целой чиселкой :)", "Координата Y места прибытия должна быть целой чиселкой :)"},
            {"Дальность маршрута должна быть чиселкой с плавающей точкой :)", "Дальность маршрута должна быть чиселкой с плавающей точкой :)"},
            {"Весьма симпатичный маршрут. Так держать", "Весьма симпатичный маршрут. Так держать"},
            {"Имя маршрута не может быть пустым", "Имя маршрута не может быть пустым"},
            {"Дальность маршрута должна быть >1", "Дальность маршрута должна быть >1"},

            {"enterDistanceED", "Введите дальность"},
            {"doneED", "Готово"},
            {"Расстояние должно быть > 1", "Расстояние должно быть > 1"},
            {"Все супер", "Все супер"},
            {"Расстояние должно быть вещественной чиселкой", "Расстояние должно быть вещественной чиселкой"},

            {"fileName", "Введите имя файла, в котором располагается скрипт"},
            {"Ммм, скрипт пустой", "Ммм, скрипт пустой"},
            {"Бе, скрипт с ошибочками, такой скрипт мы обработать не сможем", "Бе, скрипт с ошибочками, такой скрипт мы обработать не сможем"},
            {"Все супер", "Все супер"},
            {"Недостаточно прав для чтения скрипта", "Недостаточно прав для чтения скрипта"},
            {"Файла со скриптом по указанному пути не существует", "Файла со скриптом по указанному пути не существует"},
            {"Файл пуст!", "Файл пуст!"},

            {"ownerF", "Владелец"},
            {"creationDateF", "Дата Создания"},
            {"delete", "Удалить"},
            {"edit", "Изменить"},
            {"deleteCM", "Удалить"},
            {"editCM", "Изменить"}


    };

}
